package java0319;

// 문제 : 각각의 자동차가 서로 다른 최고속력으로 달리게 해주세요.


class java0319_edu {
  public static void main(String[] args) {
/*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 	@@@@@@ 각각의 자동차가 서로 다른 속력으로 달리게 @@@@@@
    // 구현시작
    
    // 구현끝
    자동차 a자동차1 = new 자동차();
    자동차1 a자동차2 = new 자동차1();
    a자동차1.달리다();
    // 출력 => 자동차가 최고속력 230km로 달립니다.

    a자동차2.달리다();
    // 출력 => 자동차가 최고속력 210km로 달립니다.
     *
	  /*
class 자동차 {
	void 달리다() {
		System.out.println("자동차가 최고속력 230km로 달립니다.");
	}
	// 구현
}
class 자동차1 extends 자동차 {
	void 달리다() {
		System.out.println("자동차가 최고속력 210km로 달립니다.");
	}
}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/
	  
/*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// 문제 : 일반변수에 값 할당과정 설명
    // 설명
    int x;
		정수 형태의 타입에 x라는 그릇을 생성
    // 설명
    x = 20;
    	x라는 그릇에 20이라는 내용물을 집어넣음
 *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/

  /*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    // 설명
    자동차 a자동차;
    
    // 설명
    a자동차 = new 자동차();
    
    // 설명
    a자동차.달리다();

    // 모든 객체들은 서로를 평생 볼 수 없다.
    // 모든 객체들은 서로를 원격조종한다.
  }
}

// 자동차 설계도!, 절대 자동차가 아니다.!!!
class 자동차 {
  // 이 메서드(함수)의 2가지 용도
  // - 변수라는 공간을 생성
  // - 
  void 달리다() {
    System.out.println("자동차가 달립니다.");
  }
}
   *@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*/
  }
  
}

